app/controllers/commodities_controller.rb

  def index
    @commodities = Commodity.all
---
SELECT `commodities`.* FROM `commodities`

  def yes
    puts "yes"
    puts "yes"
    puts "yes"
    puts "yes"
    puts @commodity.sold
    @commodity.sold = true
    @commodity.save
---
INSERT INTO `commodities` (`item_name`, `item_description`, `price`, `created_at`, `updated_at`, `contact`, `email`) VALUES ('laprop', 'contact for more', 5000, '2019-01-10 17:42:44', '2019-01-10 17:42:44', 9425160085, 'devansh@gmail.com')
UPDATE `commodities` SET `sold` = TRUE, `updated_at` = '2019-01-13 15:19:12' WHERE `commodities`.`id` = 10

  def create
    @commodity = Commodity.new(commodity_params)
    @commodity.email = current_user.email
    respond_to do |format|
      if @commodity.save
---
INSERT INTO `commodities` (`item_name`, `item_description`, `price`, `created_at`, `updated_at`, `email`) VALUES ('Bottle', 'new', 100, '2019-01-13 13:28:01', '2019-01-13 13:28:01', 'devansh@gmail.com')

  def update
    respond_to do |format|
      if @commodity.update(commodity_params)
---
UPDATE `commodities` SET `contact` = 7974484874, `updated_at` = '2019-01-10 16:59:53' WHERE `commodities`.`id` = 4

  def destroy
    @commodity.destroy
---
DELETE FROM `commodities` WHERE `commodities`.`id` = 11

    def set_commodity
      @commodity = Commodity.find(params[:id])
---
SELECT  `commodities`.* FROM `commodities` WHERE `commodities`.`id` = 10 LIMIT 1